Revit 2027 API
ParameterTypeId.BentFabricParamStraightWiresLocation Property
 "Straight Wires Location": Location of straight wires in a bent fabric.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BentFabricParamStraightWiresLocation { get; }
Public Shared ReadOnly Property BentFabricParamStraightWiresLocation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BentFabricParamStraightWiresLocation {
	ForgeTypeId^ get ();
}
static member BentFabricParamStraightWiresLocation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace